{
  "projects": [
    {
      "name": "Criwin",
      "logo": "/images/projects/criwin.png",
      "skills": ["Python", "Debian", "Proxmox"],
      "description": "Developed a self-hosted Discord bot running on a Proxmox virtual machine with Debian that downloads audio from YouTube videos and adds them to a curated sound collection. The bot can play these sounds on demand within Discord servers, providing a customizable audio experience for users.",
      "github": "https://github.com/maroonedace/CriWin"
    },
    {
      "name": "A Doki To Remember",
      "logo": "/images/projects/aDokiToRemember.png",
      "skills": ["Aseprite", "Godot"],
      "description": "Led a five-member team to develop a Godot 2D RPG focused on deflecting enemy bullets within a two-week game jam. Oversaw task distribution for sprite design, background music, and save mechanics, while personally implementing player and enemy combat systems and building the game's UI elements.",
      "embedLink": "https://maroonedace.itch.io/a-doki-to-remember",
      "github": "https://github.com/maroonedace/A-Doki-To-Remember/"
    },
    {
      "name": "AceDex",
      "logo": "/images/projects/aceDex.png",
      "skills": ["React", "Rust", "Supabase", "Tauri"],
      "description": "Built a lightweight, cross-platform Pokémon viewer that displays cards in a TCG-style format. The app uses Rust on the Tauri backend to fetch data from an external API, stores it in a Supabase database, and serves it to a React frontend for dynamic card rendering.",
      "github": "https://github.com/maroonedace/AceDex",
      "embedLink": "https://youtu.be/saD8ZQIfyYg"
    },
    {
      "name": "Food Quest",
      "logo": "/images/projects/tritonXR.png",
      "skills": ["Unity", "C#"],
      "description": "Led a six-member team to create an XR game that teaches healthy eating by having players battle “food monsters” and craft real-life recipes. Oversaw project direction and implemented player attack and enemy mechanics, while teammates developed sprites and supporting features such as teleportation and cooking systems.",
      "embedLink": "https://youtu.be/CGiiyc2ylgk",
      "github": "https://github.com/TritonXR/FoodQuest"
    },
    {
      "name": "The Necessity for Nutrition",
      "logo": "/images/projects/theNecessityForNutrition.png",
      "skills": ["Sckit-learn", "Numpy", "Jupyter", "Anaconda", "Pandas", "Matplotlib"],
      "description": "Developed a classification model using decision trees, logistic regression, and SVMs to analyze datasets of cereal, McDonald's, and Starbucks products. The project revealed a correlation between food popularity and higher levels of unhealthy ingredients.",
      "github": "https://github.com/maroonedace/The-Necessity-for-Nutrition"
    }
  ]
}
